//=======================================================================================
//　アルゴリズム
//　課題：ユークリッドの互除法
//　名前：柳瀬 拓臣
//=======================================================================================

#include <iostream>

using namespace std;

int main()
{
	// 前判定型反復構造

	int a, b, r;

	cout << "大きい方の値を入力してください。" << endl;
	cin >> a;
	cout << "小さい方の値を入力してください。" << endl;
	cin >> b;

	r = a%b;

	while (r != 0)
	{
		a = b;
		b = r;
		r = a%b;
	}

	cout << "最大公約数は" << b << "です。" << endl;

	// 入力待ち
	cin.get();

	return 0;
}