//=======================================================================================
//　アルゴリズム
//　課題：ユークリッドの互除法
//　名前：柳瀬 拓臣
//=======================================================================================

#include <iostream>

using namespace std;

int main()
{
	int a, b, r;

	cout << "大きい方の値を入力してください。" << endl;
	cin >> a;
	cout << "小さい方の値を入力してください。" << endl;
	cin >> b;

	// 前判定型反復構造
	r = a%b;
	while (r != 0)
	{
		a = b;
		b = r;
		r = a%b;
	}
	cout << "前判定型反復構造:最大公約数は" << b << "です。" << endl;

	//// 後判定型反復構造
	//do {
	//	r = a%b;
	//	a = b;
	//	b = r;
	//} while (r != 0);
	//cout << "後判定型反復構造:最大公約数は" << a << "です。" << endl;

	// 入力待ち
	cin.get();

	return 0;
}